Reports/ПроизвольныйЗапрос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>ПроизвольныйЗапрос</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТЧ_Ссылка</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ПроизвольныйЗапрос/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаВыполнитьЗапрос(Команда)
	
	НеотформатированныйТекст = ТекстЗапроса.ПолучитьТекст();
	ОтформатированныйТекст = СтрЗаменить(НеотформатированныйТекст, "|", "");
	
	Если ПустаяСтрока(ОтформатированныйТекст) Тогда
		ТекстПредупреждения = НСтр("ru = 'Введите текст запроса.'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
	КонецЕсли;
	
	ТекстЗапроса.УстановитьТекст(ОтформатированныйТекст);
	
	РезультатВыполненияЗапроса = Новый ТабличныйДокумент;
	
	ВыполнитьЗапрос(ТекстЗапроса.ПолучитьТекст());
	
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.Запрос;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапрос(ПолученныйТекстЗапроса)
	Запрос = Новый Запрос;
	Запрос.Текст = ПолученныйТекстЗапроса;
	
	Запрос.УстановитьПараметр("ТЧ",Отчет.ТЧ_ТабличнаяЧасть.Выгрузить(,"ТЧ_Ссылка"));
	Запрос.УстановитьПараметр("НачалоПериода",Отчет.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",Отчет.КонецПериода);
	Запрос.УстановитьПараметр("ЗначениеСсылка",Отчет.ЗначениеСсылка);
	Запрос.УстановитьПараметр("ЗначениеЧисло",Отчет.ЗначениеЧисло);
	Запрос.УстановитьПараметр("ЗначениеБулево",Отчет.ЗначениеБулево);
	Запрос.УстановитьПараметр("ЗначениеСтрока",Отчет.ЗначениеСтрока);
	
		РезультатЗапроса = Запрос.Выполнить();
	РезультатЗапросаТЗ = РезультатЗапроса.Выгрузить();
	
	ТабДок = РезультатВыполненияЗапроса;
	ОбластьШапкаТаблицы = ТабДок.ПолучитьОбласть(1,1,1,РезультатЗапросаТЗ.Колонки.Количество());
	ОбластьДанныеТаблицы = ТабДок.ПолучитьОбласть(2,1,2,РезультатЗапросаТЗ.Колонки.Количество());	
	
	ЗаголовкиКолонокТаблицы = Новый Структура;
	
	ЛинияОбводки = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	ШрифтЗаголовкаТаблицы = Новый Шрифт(, 8, Истина, , , );
	ШрифтДанныхТаблицы = Новый Шрифт(,8,,,,);
	
	ЦветФонаШапкиТаблицы = Новый Цвет(255,255,153);
	ЦветФонаДанныхТаблицы = Новый Цвет(245,255,250);
	
	Для Счетчик = 1 по РезультатЗапросаТЗ.Колонки.Количество() Цикл
		
		Колонка = РезультатЗапросаТЗ.Колонки[Счетчик-1];
		ЗаголовкиКолонокТаблицы.Вставить(Колонка.Имя, Колонка.имя);
		
		ОбластьЗаполненияШапки = ОбластьШапкаТаблицы.Область(1,Счетчик,1,Счетчик);
		ОбластьЗаполненияШапки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьЗаполненияШапки.ШиринаКолонки = 15;
		ОбластьЗаполненияШапки.Обвести(ЛинияОбводки,ЛинияОбводки,ЛинияОбводки,ЛинияОбводки);
		ОбластьЗаполненияШапки.Параметр = Колонка.Имя;
		ОбластьЗаполненияШапки.Шрифт = ШрифтЗаголовкаТаблицы;
		ОбластьЗаполненияШапки.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
		ОбластьЗаполненияШапки.ЦветФона = ЦветФонаШапкиТаблицы;
		
		ОбластьЗаполненияДанных = ОбластьДанныеТаблицы.Область(1,Счетчик,1,Счетчик);
		ОбластьЗаполненияДанных.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьЗаполненияДанных.ШиринаКолонки = 15;
		ОбластьЗаполненияДанных.Обвести(ЛинияОбводки,ЛинияОбводки,ЛинияОбводки,ЛинияОбводки);
		ОбластьЗаполненияДанных.Параметр = Колонка.Имя;
		ОбластьЗаполненияДанных.Шрифт = ШрифтДанныхТаблицы;
		ОбластьЗаполненияДанных.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
		ОбластьЗаполненияДанных.ЦветФона = ЦветФонаДанныхТаблицы;                     
		
	КонецЦикла;
	                       
	ОбластьШапкаТаблицы.Параметры.Заполнить(ЗаголовкиКолонокТаблицы);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьДанныеТаблицы.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьДанныеТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры
